DataProcessors/РаботаСТестами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РаботаСТестами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗаданияТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияТестирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазультатТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоставЗаданийТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СоставЗаданийТестирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АлгоритмТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АлгоритмыТестирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/РаботаСТестами/Forms/ФормированиеЗаданий/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоСеансов = 1;
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмыТестированияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.АлгоритмыТестирования.ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	Если ЗначениеЗаполнено(ИнформационнаяБаза) И АлгоритмыТестирования.Количество() > 0 Тогда
		СоздатьЗаданияНаСервере();
		АлгоритмыТестирования.Очистить();
	Иначе
		Сообщить("Нужно заполнить информационную базу и выбрать алгоритмы");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданияНаСервере()
	
	НачатьТранзакцию();
	
	ТекПорт = ТестированиеПриложенийСервер.СвободныйПорт();
	
	Для СчетчикСеансов = 1 по КоличествоСеансов цикл
	
		УИД = Строка(Новый УникальныйИдентификатор);
		
		МенеджерЗадания = РегистрыСведений.ЗаданияТестирования.СоздатьМенеджерЗаписи();
		МенеджерЗадания.ИнформационнаяБаза = ИнформационнаяБаза;
		МенеджерЗадания.УИД = УИД;
		МенеджерЗадания.Порт = ТекПорт;
		МенеджерЗадания.Записать();
		
		НаборЗаписейАлгоритмов = РегистрыСведений.СоставЗаданийТестирования.СоздатьНаборЗаписей();
		НаборЗаписейАлгоритмов.Отбор.УИД.Установить(УИД);
		НаборЗаписейАлгоритмов.Прочитать();
		
		СчетчикПорядка = 1;
		Для Каждого ТекАлгоритм из АлгоритмыТестирования цикл
			НовыйАлгоритм = НаборЗаписейАлгоритмов.Добавить();
			НовыйАлгоритм.УИД = УИД;
			НовыйАлгоритм.Порядок = СчетчикПорядка;
			НовыйАлгоритм.АлгоритмТестирования = ТекАлгоритм.Алгоритм;
			НовыйАлгоритм.Количество = ТекАлгоритм.Количество;
			СчетчикПорядка = СчетчикПорядка + 1;
		КонецЦикла;
		
		НаборЗаписейАлгоритмов.Записать();
		ТекПорт = ТекПорт + 1;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере()
	АлгоритмыТестирования.Загрузить(Шаблон.Алгоритмы.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуНаСервере();
КонецПроцедуры
